app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sdfg"], ["created_at", "2024-01-30 01:29:21.868668"], ["updated_at", "2024-01-30 01:29:21.868668"], ["author", nil], ["price", nil], ["published_date", nil]]
---
  def create
    @book = Book.new(book_params)

    if @book.title.blank?
      redirect_to books_path, notice: 'Book could not be created'
    else
      respond_to do |format|
        if @book.save